# 课程： Python分析工业大数据

## 第四章 Pandas

In [2]:
import numpy as np
import pandas as pd

两种结构， pd.Series 和 pd.DataFrame

### 创建 pd.Series 数据

In [2]:
production = pd.Series(data = [20, 30, 15, 5], index = ['Chevrolet', 'Buick', 'Cadilac', 'GMC'])

production

Chevrolet    20
Buick        30
Cadilac      15
GMC           5
dtype: int64

In [3]:
# pd.Series的基本特性
print('car production has shape:',production.shape)
print('car production has dimension:', production.ndim)
print('car production has a total of', production.size, 'elements')

car production has shape: (4,)
car production has dimension: 1
car production has a total of 4 elements

In [4]:
# pd.Series的基本查询： in commend
'Lincoln' in production

False

### 读取pd.Series数据  
.loc 与 .iloc

In [7]:
production[['Buick', 'Cadilac']]

Buick      30
Cadilac    15
dtype: int64

In [8]:
production[[0, 2]]

Chevrolet    20
Cadilac      15
dtype: int64

In [55]:
#without .loc, and .iloc
print(production['Buick'])
print(production[['Buick', 'Cadilac']])
print(production[[0, 1]])
print(production[[-1]])

30
Buick      30
Cadilac    15
dtype: int64
Chevrolet    20
Buick        30
dtype: int64
GMC    5
dtype: int64

In [56]:
# with .loc 与.iloc
production.loc[['Buick', 'Cadilac']]

Buick      30
Cadilac    15
dtype: int64

In [57]:
production.iloc[[1,2]]

Buick      30
Cadilac    15
dtype: int64

### 删除pd.Series数据元素

In [9]:
# method： .drop(label, inplace = False)
production.drop('Buick')

Chevrolet    20
Cadilac      15
GMC           5
dtype: int64

In [10]:
production

Chevrolet    20
Buick        30
Cadilac      15
GMC           5
dtype: int64

In [11]:
production.drop('Buick', inplace=True)

In [12]:
production

Chevrolet    20
Cadilac      15
GMC           5
dtype: int64

### 算术/基本数学运算

In [13]:
production = pd.Series(data = [20, 30, 15, 5], 
                           index = ['Chevrolet', 'Buick', 'Cadilac', 'GMC'])

In [14]:
production + 5

Chevrolet    25
Buick        35
Cadilac      20
GMC          10
dtype: int64

In [66]:
print(production +5) 
# print(production - 5) 
# print(production * 5) 
# print(production / 5)

Chevrolet    25
Buick        35
Cadilac      20
GMC          10
dtype: int64

In [15]:
# np.sqrt(), np.exp(), np.power(data, N)
np.exp(production)

Chevrolet    4.851652e+08
Buick        1.068647e+13
Cadilac      3.269017e+06
GMC          1.484132e+02
dtype: float64

### 创建Pandas 数据

In [16]:
# 从字典创建pandas
plant = {"stamping": {"production": 25, "inventory": 3.5,  "FTY": 0.98 },
            "assembly": {"production": 26.5, "inventory": 0.5, "FTY": 0.95 },
            "painting": {"production": 26.5, "inventory": 0.8, "FTY": 0.99 }}
df_plant = pd.DataFrame(plant)
df_plant

            assembly  painting  stamping
FTY             0.95      0.99      0.98
inventory       0.50      0.80      3.50
production     26.50     26.50     25.00

In [74]:
# 关于NaN
#例子
data = {'Temp': pd.Series([65, 66, 67]),
     'pressure':pd.Series([1.2, 1.21, 1.09, 1.15])}

df = pd.DataFrame(data)
df

   Temp  pressure
0  65.0      1.20
1  66.0      1.21
2  67.0      1.09
3   NaN      1.15

### 访问DataFrame数据元素

In [17]:
df_plant

            assembly  painting  stamping
FTY             0.95      0.99      0.98
inventory       0.50      0.80      3.50
production     26.50     26.50     25.00

In [18]:
# 访问列, 方案1, dataframe[column label]
df_plant['assembly']

FTY            0.95
inventory      0.50
production    26.50
Name: assembly, dtype: float64

In [19]:
type(df_plant['assembly'])

pandas.core.series.Series

In [83]:
#访问列， 方案2, dataframe[[column label]]
df_plant[['assembly']]

            assembly
FTY             0.95
inventory       0.50
production     26.50

In [84]:
type(df_plant[['assembly']])

pandas.core.frame.DataFrame

In [85]:
#访问行， 方案1, dataframe.loc[row label]
df_plant.loc['FTY']

stamping    0.98
assembly    0.95
painting    0.99
Name: FTY, dtype: float64

In [87]:
type(df_plant.loc['FTY'])

pandas.core.series.Series

In [88]:
#访问行， 方案2, dataframe.loc[[row label]]
df_plant.loc[['FTY']]

     stamping  assembly  painting
FTY      0.98      0.95      0.99

In [89]:
type(df_plant.loc[['FTY']])

pandas.core.frame.DataFrame

In [101]:
#访问行， 方案3 dataframe.iloc[row index]
df_plant.iloc[0]

stamping    0.98
assembly    0.95
painting    0.99
Name: FTY, dtype: float64

In [105]:
type(df_plant.iloc[0])

pandas.core.series.Series

In [104]:
#访问行， 方案4, dataframe.iloc[[row index]]
df_plant.iloc[[0, 1]]

           stamping  assembly  painting
FTY            0.98      0.95      0.99
inventory      3.50      0.50      0.80

In [106]:
type(df_plant.iloc[[0, 1]])

pandas.core.frame.DataFrame

In [107]:
#访问元素 , 方案1， dataframe[column label][row label]
df_plant['stamping']['inventory']

3.5

In [110]:
# #访问元素 , 方案2 dataframe.iloc[column index, row index]
df_plant.iloc[0,1]

0.95

## 修改数据表中的值

In [6]:
import pandas as pd
df = pd.DataFrame({'One':['a','b','c'], 'two':[12, 1, 2]})
df

  One  two
0   a   12
1   b    1
2   c    2

In [7]:
# 修改某个位置的值
df.at[1, 'One']='x'
df

  One  two
0   a   12
1   x    1
2   c    2

In [8]:
# 修改某行的值
df.at[2] = 'y'
df

  One two
0   a  12
1   x   1
2   y   y

In [9]:
# 修改某列的值
df.at[:, 'two'] = 1000
df

  One   two
0   a  1000
1   x  1000
2   y  1000

In [11]:
# 将某值改成另一值
df.replace(1000, 0.1)

  One  two
0   a  0.1
1   x  0.1
2   y  0.1

## 条件选择

In [3]:
# 从字典创建pandas
plant = {"stamping": {"production": 25, "inventory": 3.5,  "FTY": 0.98 },
            "assembly": {"production": 26.5, "inventory": 0.5, "FTY": 0.95 },
            "painting": {"production": 26.5, "inventory": 0.8, "FTY": 0.99 }}
df_plant = pd.DataFrame(plant)
df_plant

            assembly  painting  stamping
FTY             0.95      0.99      0.98
inventory       0.50      0.80      3.50
production     26.50     26.50     25.00

In [5]:
new_df = df_plant.T
new_df

           FTY  inventory  production
assembly  0.95        0.5        26.5
painting  0.99        0.8        26.5
stamping  0.98        3.5        25.0

In [6]:
new_df[new_df['inventory']>0.6]

           FTY  inventory  production
painting  0.99        0.8        26.5
stamping  0.98        3.5        25.0

In [8]:
# ~ invert operator
new_df[~(new_df['inventory']>1)]

           FTY  inventory  production
assembly  0.95        0.5        26.5
painting  0.99        0.8        26.5

### 增加Dataframe数据

In [111]:
df_plant

            stamping  assembly  painting
FTY             0.98      0.95      0.99
inventory       3.50      0.50      0.80
production     25.00     26.50     26.50

In [113]:
# 增加列
df_plant['body'] = [0.96, 1.3, 26]
df_plant

            stamping  assembly  painting   body
FTY             0.98      0.95      0.99   0.96
inventory       3.50      0.50      0.80   1.30
production     25.00     26.50     26.50  26.00

In [114]:
# 增加行
new_row = [{'stamping': 0.75, 'assembly': 0.9, 'painting': 0.8, 'body': 0.82}]

df_plant = df_plant.append(pd.DataFrame(new_row, index = ['OEE']))

/Users/RichardZhou/anaconda3/lib/python3.7/site-packages/pandas/core/frame.py:6211: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort)

In [115]:
df_plant

            assembly   body  painting  stamping
FTY             0.95   0.96      0.99      0.98
inventory       0.50   1.30      0.80      3.50
production     26.50  26.00     26.50     25.00
OEE             0.90   0.82      0.80      0.75

### 删除DataFrame数据  
两种方法:  .pop(), 和 .drop()

In [116]:
# 删除列 , 用method: .pop(column)
df_plant.pop('body')

FTY            0.96
inventory      1.30
production    26.00
OEE            0.82
Name: body, dtype: float64

In [117]:
df_plant

            assembly  painting  stamping
FTY             0.95      0.99      0.98
inventory       0.50      0.80      3.50
production     26.50     26.50     25.00
OEE             0.90      0.80      0.75

In [118]:
# 删除列， 用method: .drop(column)
df_plant.drop(['painting'], axis = 1)

            assembly  stamping
FTY             0.95      0.98
inventory       0.50      3.50
production     26.50     25.00
OEE             0.90      0.75

In [120]:
# 删除行， 用method, .drop(row)
df_plant.drop(['OEE'], axis = 0)

            assembly  painting  stamping
FTY             0.95      0.99      0.98
inventory       0.50      0.80      3.50
production     26.50     26.50     25.00

### 修改列/行的名称  
用method: .rename()

In [123]:
# 修改列名
df_plant = df_plant.rename(columns = {'painting': 'coating'})

df_plant

            assembly  coating  stamping
FTY             0.95     0.99      0.98
inventory       0.50     0.80      3.50
production     26.50    26.50     25.00
OEE             0.90     0.80      0.75

In [124]:
# 修改行名
df_plant = df_plant.rename(index = {'OEE': 'Overall Equipment Effeciency'})

df_plant

                              assembly  coating  stamping
FTY                               0.95     0.99      0.98
inventory                         0.50     0.80      3.50
production                       26.50    26.50     25.00
Overall Equipment Effeciency      0.90     0.80      0.75

### 处理缺失值NaN  
      * 计算NaN数量  
      *  替换NaN

In [125]:
# 创造NaN
new_row = [{'assembly': 200, 'coating': 156 }]

df_plant = df_plant.append(pd.DataFrame(new_row, index = ['cost_saving']))

/Users/RichardZhou/anaconda3/lib/python3.7/site-packages/pandas/core/frame.py:6211: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort)

In [127]:
df_plant['body'] = [None, 1.3, 26, None, None]

In [128]:
df_plant

                              assembly  coating  stamping  body
FTY                               0.95     0.99      0.98   NaN
inventory                         0.50     0.80      3.50   1.3
production                       26.50    26.50     25.00  26.0
Overall Equipment Effeciency      0.90     0.80      0.75   NaN
cost_saving                     200.00   156.00       NaN   NaN

In [131]:
# 计算NaN的数量, method:  .isnull()
print(df_plant.isnull().sum())
print(df_plant.isnull().sum().sum())

assembly    0
coating     0
stamping    1
body        3
dtype: int64
4

In [132]:
#或者得到布尔值分布
df_plant.isnull()

                              assembly  coating  stamping   body
FTY                              False    False     False   True
inventory                        False    False     False  False
production                       False    False     False  False
Overall Equipment Effeciency     False    False     False   True
cost_saving                      False    False      True   True

In [133]:
# 计算非NaN的数量
df_plant.count()

assembly    5
coating     5
stamping    4
body        2
dtype: int64

In [134]:
# 删除NaN的列或者行, 用 .dropna(axis = 0/1, inplace = False)
df_plant.dropna(axis = 1)

                              assembly  coating
FTY                               0.95     0.99
inventory                         0.50     0.80
production                       26.50    26.50
Overall Equipment Effeciency      0.90     0.80
cost_saving                     200.00   156.00

In [136]:
# 替换NaN为指定值， 用method: .fillna()
df_plant.fillna(0)

                              assembly  coating  stamping  body
FTY                               0.95     0.99      0.98   0.0
inventory                         0.50     0.80      3.50   1.3
production                       26.50    26.50     25.00  26.0
Overall Equipment Effeciency      0.90     0.80      0.75   0.0
cost_saving                     200.00   156.00      0.00   0.0

In [152]:
#替换1: NaN为前序值， 用method: .fillna(method = 'ffill', axis), forward filling
#替换2: NaN为后序值， 用method: .fillna(method = 'backfill', axis), backward filling
df_plant.fillna(method = 'ffill', axis = 0)

                              assembly  coating  stamping  body
FTY                               0.95     0.99      0.98   NaN
inventory                         0.50     0.80      3.50   1.3
production                       26.50    26.50     25.00  26.0
Overall Equipment Effeciency      0.90     0.80      0.75  26.0
cost_saving                     200.00   156.00      0.75  26.0

In [141]:
#替换3: NaN为插入值， 用method: .interpolate(method = 'linear', axis), interpolation filling
df_plant.interpolate(method = 'linear', axis = 1)

                              assembly  coating  stamping    body
FTY                               0.95     0.99      0.98    0.98
inventory                         0.50     0.80      3.50    1.30
production                       26.50    26.50     25.00   26.00
Overall Equipment Effeciency      0.90     0.80      0.75    0.75
cost_saving                     200.00   156.00    156.00  156.00

In [142]:
df_plant

                              assembly  coating  stamping  body
FTY                               0.95     0.99      0.98   NaN
inventory                         0.50     0.80      3.50   1.3
production                       26.50    26.50     25.00  26.0
Overall Equipment Effeciency      0.90     0.80      0.75   NaN
cost_saving                     200.00   156.00       NaN   NaN

### 载入为DataFrame数据

In [ ]:
# 用pd.read_csv('filename')
df = pd.read_csv('filename.csv')

In [ ]:
# 查看数据表头, .head(N)

In [ ]:
# 查看数据表尾, .tai l(N)

In [143]:
# 数据表是否有检查NaN， .isnull().any()

In [144]:
# 数据表中连续变量的基本统计值, dataframe[columns].describe()

In [145]:
# 各种统计分量,  .max(), .min(), .mean(), .corr()

### 数据分层  
.groupby()

In [148]:
df_complaint = pd.read_csv('06Complaint Resolution.csv')

In [149]:
df_complaint.head(3)

   Complaint No  Resolution Time   Team
0             1              8.7  TeamB
1             2              9.4  TeamB
2             3             11.4  TeamB

In [151]:
# 不同team处理时间的平均值
df_complaint.groupby(['Team'])['Resolution Time'].mean()

Team
TeamA    6.650000
TeamB    9.247368
TeamC    4.215385
Name: Resolution Time, dtype: float64

### 选择变量满足特定水平的数据

In [2]:
import pandas as pd

test = pd.DataFrame({'name':['a', 'c', 'b', 'a'], 'value': [20, 30, 10, 5]})
test

  name  value
0    a     20
1    c     30
2    b     10
3    a      5

In [3]:
#option1: 变量转为category类型
test['name'] = pd.Categorical(test['name'], ['a', 'b', 'c'])
test

  name  value
0    a     20
1    c     30
2    b     10
3    a      5

In [5]:
test.sort_values('name')

  name  value
0    a     20
3    a      5
2    b     10
1    c     30

In [6]:
# option2 : 选择自我设定范围的数据

# 选定变量 name 下的需要的水平, a与b
selected_list = ['a', 'b']

#选择变量name下水平a 与 b 以及变量value中值为20的数据， 用method .isin( )
test[test['name'].isin(['a', 'b'])&test['value'].isin([20])]

  name  value
0    a     20

In [ ]:
df.drop(index = ' ', level = 0) # level 用于在multiindex中，选择index， level=0,第一个index; index=1, 第二个index;

### 排序

In [4]:
# sort_index()

#sort_value()

In [9]:
a = input()

w

In [10]:
a

'w'

In [ ]:
###

In [1]:
import pandas as pd
import numpy as np

In [3]:
countries_population = {"Italy": 59000000, "France": 65000000,
...                         "Malta": 434000, "Maldives": 434000,
...                         "Brunei": 434000, "Iceland": 337000,
...                         "Nauru": 11300, "Tuvalu": 11300,
...                         "Anguilla": 11300, "Monserat": 5200}
countries_population

{'Italy': 59000000,
 'France': 65000000,
 'Malta': 434000,
 'Maldives': 434000,
 'Brunei': 434000,
 'Iceland': 337000,
 'Nauru': 11300,
 'Tuvalu': 11300,
 'Anguilla': 11300,
 'Monserat': 5200}

In [5]:
s = pd.Series(countries_population)
s

Anguilla       11300
Brunei        434000
France      65000000
Iceland       337000
Italy       59000000
Maldives      434000
Malta         434000
Monserat        5200
Nauru          11300
Tuvalu         11300
dtype: int64

In [6]:
s.nlargest(3)

France    65000000
Italy     59000000
Brunei      434000
dtype: int64